In [48]:
import numpy as np 
import pandas as pd

In [49]:
df = pd.read_csv('Academic-Performance-Dataset.csv')

In [50]:
df.head()

,Rollno,Name,Gender,Branch,Attendence,Phy_marks,Che_marks,EM1_marks,PPS_marks,SME_marks,Total Marks,Percentage
0,1,Mohammed,M,Comp,72.0,62.0,98.0,63.0,89.0,36.0,368,73.6
1,2,Reyansh,M,IT,58.0,62.0,83.0,83.0,88.0,34.0,350,70.0
2,3,Aarav,M,IT,57.0,-20.0,100.0,NaN,56.0,36.0,192,38.4
3,4,Atharv,M,IT,60.0,89.0,83.0,70.0,33.0,23.0,298,59.6
4,5,Vivaan,M,Comp,85.0,90.0,NaN,78.0,23.0,56.0,247,49.4

In [51]:
df.isnull().sum()

Rollno         0
Name           2
Gender         0
Branch         0
Attendence     0
Phy_marks      1
Che_marks      3
EM1_marks      2
PPS_marks      1
SME_marks      0
Total Marks    0
Percentage     0
dtype: int64

In [52]:
cols_null = []
for cols in df.columns:
    if df[cols].isna().any():
        cols_null.append(cols)

cols_null
cols_null.remove('Name')
cols_null
for cols in cols_null:
    col_mean = df[cols].mean()
    df[cols].fillna(col_mean,inplace=True)
    
df.isnull().sum()

Rollno         0
Name           2
Gender         0
Branch         0
Attendence     0
Phy_marks      0
Che_marks      0
EM1_marks      0
PPS_marks      0
SME_marks      0
Total Marks    0
Percentage     0
dtype: int64

In [53]:
df.dropna(subset=['Name'],inplace=True)
df.isnull().sum()

Rollno         0
Name           0
Gender         0
Branch         0
Attendence     0
Phy_marks      0
Che_marks      0
EM1_marks      0
PPS_marks      0
SME_marks      0
Total Marks    0
Percentage     0
dtype: int64

In [54]:
df.dtypes

Rollno           int64
Name            object
Gender          object
Branch          object
Attendence     float64
Phy_marks      float64
Che_marks      float64
EM1_marks      float64
PPS_marks      float64
SME_marks      float64
Total Marks      int64
Percentage     float64
dtype: object

In [57]:
numerical = []
for cols in df.columns:
    if df[cols].dtype != 'object':
        numerical.append(cols)
        
numerical

['Rollno',
 'Attendence',
 'Phy_marks',
 'Che_marks',
 'EM1_marks',
 'PPS_marks',
 'SME_marks',
 'Total Marks',
 'Percentage']

In [58]:
for col in numerical:
    q1 = df[col].quantile(0.25)
    q3 = df[col].quantile(0.75)
    IQR = q3 - q1
    low = q1 - (1.5 * IQR)
    high = q3 + (1.5 * IQR)
    df.loc[df[col]<low,col] = low
    df.loc[df[col]>high,col] = high

In [59]:
def grading(val):
    if val >= 80 and val <=100:
        return 'O'
    elif val >= 70 and val <80:
        return 'A'
    elif val >= 60 and val <70:
        return 'B'
    elif val < 60:
        return 'F'

In [60]:
df['Grade'] = df['Percentage'].apply(grading)

In [61]:
df.head()

,Rollno,Name,Gender,Branch,Attendence,Phy_marks,Che_marks,EM1_marks,PPS_marks,SME_marks,Total Marks,Percentage,Grade
0,1,Mohammed,M,Comp,72.0,62.00,98.000000,63.000000,89.0,36.0,368.0,73.6,A
1,2,Reyansh,M,IT,58.0,62.00,83.000000,83.000000,88.0,34.0,350.0,70.0,A
2,3,Aarav,M,IT,57.0,11.75,100.000000,83.444444,56.0,36.0,192.0,38.4,F
3,4,Atharv,M,IT,60.0,89.00,83.000000,70.000000,33.0,23.0,298.0,59.6,F
4,5,Vivaan,M,Comp,85.0,90.00,80.764706,78.000000,23.0,56.0,247.0,49.4,F